{
   "CONF_PARAM_1" :
   {
      "CONF_PARAM_DEC_ID" : "MC00",
      "CONF_PARAM_LABEL" : "Total Number of Cycles",
      "CONF_PARAM_DEFINITION" : "Total Number of cycles This is the total number of cycles of descent, submerged drift, ascent and transmission that ARVOR-I will perform. The mission ends and ARVOR-I enters Life Expiry mode when this number of cycles has been completed. The capacity of ARVOR-I 's batteries is sufficient for at least 300 cycles (depending on Battery type and volume of CTD data to be acquired and transmitted). If you wish to recover ARVOR-I at the end of the mission, you must set the number of cycles at less than 300 to ensure there is sufficient battery capacity remaining to allow ARVOR-I to return to the sea surface and enter Life Expiry. Under favourable conditions, the battery capacity may exceed 300 cycles. If you do not plan to recover the ARVOR-I float, you may choose to set the number of cycles to 300 to ensure that ARVOR-I completes the maximum number of cycles possible.",
      "CONF_PARAM_NAME" : "CONFIG_MaxCycles_NUMBER",
      "CONF_PARAM_DESCRIPTION" : "Applies to PROVOR and ARVOR floats, profiler configuration - Number of cycles before float turns itself off, goes into end of life mode, or into recovery mode"
   },
   "CONF_PARAM_2" :
   {
      "CONF_PARAM_DEC_ID" : "MC002",
      "CONF_PARAM_LABEL" : "Cycle period",
      "CONF_PARAM_DEFINITION" : "Decoder management of MC2/MC3 configuration parameter",
      "CONF_PARAM_NAME" : "CONFIG_CycleTime_hours",
      "CONF_PARAM_DESCRIPTION" : "For APEX and ARVOR floats this is the total duration of one cycle, usually 240 hours (10 days). For SOLO floats this is the total duration of one cycle, assuming that all float operations reach their full time-out intervals before moving to the next float stage. Typically the actual cycle time will be shorter than this value."
   },
   "CONF_PARAM_3" :
   {
      "CONF_PARAM_DEC_ID" : "MC011",
      "CONF_PARAM_LABEL" : "Drift depth",
      "CONF_PARAM_DEFINITION" : "Decoder management of MC11/MC13 configuration parameter",
      "CONF_PARAM_NAME" : "CONFIG_ParkPressure_dbar",
      "CONF_PARAM_DESCRIPTION" : "park pressure - this may change if the float is reprogrammed and must be reported in the mission configuration settings"
   },
   "CONF_PARAM_4" :
   {
      "CONF_PARAM_DEC_ID" : "MC012",
      "CONF_PARAM_LABEL" : "Profile depth",
      "CONF_PARAM_DEFINITION" : "Decoder management of MC12/MC14 configuration parameter",
      "CONF_PARAM_NAME" : "CONFIG_ProfilePressure_dbar",
      "CONF_PARAM_DESCRIPTION" : "profile pressure - this may change if the float is reprogrammed and must be reported in the mission configuration settings"
   },
   "CONF_PARAM_5" :
   {
      "CONF_PARAM_DEC_ID" : "MC04",
      "CONF_PARAM_LABEL" : "Reference Day",
      "CONF_PARAM_DEFINITION" : "Reference day (number of days) The float’s internal clock day number is set to zero when the mission starts. When this float day number equals the reference day “MC4”, the float performs its first profile. Thus, as this parameter defines a particular day on which the first profile is to be made, it allows you to configure a group of floats so that they all conduct their first profile at the same time. When setting the reference day, it is recommended to allow enough time between the deployment and reach of profiling depth. Using a reference day of at least 2 will ensure the first profile to be completed.",
      "CONF_PARAM_NAME" : "CONFIG_FloatReferenceDay_FloatDay",
      "CONF_PARAM_DESCRIPTION" : "Profiler configuration - Reference day, for PROVOR and ARVOR floats this is: The day number on which the first profile is to be made. The day when the mission starts is zero."
   },
   "CONF_PARAM_6" :
   {
      "CONF_PARAM_DEC_ID" : "MC05",
      "CONF_PARAM_LABEL" : "Estimated time at the surface",
      "CONF_PARAM_DEFINITION" : "Expected time at the surface (hours) Expected time float must reach surface.",
      "CONF_PARAM_NAME" : "CONFIG_SurfaceTime_HH",
      "CONF_PARAM_DESCRIPTION" : "Hour of the float surfacing"
   },
   "CONF_PARAM_7" :
   {
      "CONF_PARAM_DEC_ID" : "MC06",
      "CONF_PARAM_LABEL" : "Delay Before Mission",
      "CONF_PARAM_DEFINITION" : "Delay before mission (minutes) To prevent ARVOR-I from trying to sink while still on deck, the float waits for this time before commanding the buoyancy engine to start the descent. After disconnection of the PC, followed by removal of the magnet, ARVOR-I will wait for this delay before beginning the descent. The delay is measured after the first start of the pump which confirms the removal of the magnet (see section 2.4.1) and before the start of the descent.",
      "CONF_PARAM_NAME" : "CONFIG_DelayBeforeMissionStart_minutes",
      "CONF_PARAM_DESCRIPTION" : "Float waiting period before the first cycle of its mission (in minutes)."
   },
   "CONF_PARAM_8" :
   {
      "CONF_PARAM_DEC_ID" : "MC07",
      "CONF_PARAM_LABEL" : "CTD acquisition mode",
      "CONF_PARAM_DEFINITION" : "CTD sensor acquisition mode 1 = Continuous pump mode (recommended), CTD pump will be active during complete profile 2 = ECO Mode (Measurement is taken in the middle of the theoretical slice). 3 = Mix-mode (ECO mode in Deep zone, Continuous pump mode in intermediate & shallow zone) 4 = Spot-sampling mode (pump is active for 20s approx, then sample is acquired) With mode, 2, 3 and 4, slice thickness must be parametered to stay inferior to 5 dBar. For thin slice thickness (< 5 dBar), continuous mode is needed",
      "CONF_PARAM_NAME" : "CONFIG_CTDPowerAcquisitionMode_NUMBER",
      "CONF_PARAM_DESCRIPTION" : "Power acquisition mode of the Sensor defined by <short sensor name> Input options for CTD (1 : continuous, 2 : pulsed). Input options for Optode (0: none, 1 : continuous, 2 : pulsed)."
   },
   "CONF_PARAM_9" :
   {
      "CONF_PARAM_DEC_ID" : "MC08",
      "CONF_PARAM_LABEL" : "Descent Sampling Period",
      "CONF_PARAM_DEFINITION" : "Descent sampling period (seconds) The time interval between successive CTD measurements during descent. If this parameter is set to 0 seconds, no profile will be carried out during the descent phase. Nevertheless, due to the ARGO requirements, the first descent profile of the mission is automatically done even if the parameter was equal to 0. Minimum value is 8 seconds.",
      "CONF_PARAM_NAME" : "CONFIG_DescentToParkPresSamplingTime_seconds",
      "CONF_PARAM_DESCRIPTION" : "Sampling period during the descent to parking pressure (in seconds)."
   },
   "CONF_PARAM_10" :
   {
      "CONF_PARAM_DEC_ID" : "MC09",
      "CONF_PARAM_LABEL" : "Drift Sampling Period",
      "CONF_PARAM_DEFINITION" : "Drift sampling period (hours) The time interval between successive CTD measurements during ARVOR-I 's stay at the drift depth.",
      "CONF_PARAM_NAME" : "CONFIG_ParkSamplingPeriod_hours",
      "CONF_PARAM_DESCRIPTION" : "specifies sampling period during the park phase, e.g. for APEX floats could be hourly or for ARVOR floats 12 hourly, for SOLO/SOLOII floats this definition is: P,T,S is sampled during drift (park) every CONFIG_ParkSamplingPeriod_hours, e.g. every 2 hours."
   },
   "CONF_PARAM_11" :
   {
      "CONF_PARAM_DEC_ID" : "MC10",
      "CONF_PARAM_LABEL" : "Ascent Sampling Period",
      "CONF_PARAM_DEFINITION" : "Ascent sampling period (seconds) The time interval between successive CTD measurements during ascent. Minimum value is 8 seconds.",
      "CONF_PARAM_NAME" : "CONFIG_AscentSamplingPeriod_seconds",
      "CONF_PARAM_DESCRIPTION" : "Sampling period during the ascending profile (in seconds)."
   },
   "CONF_PARAM_12" :
   {
      "CONF_PARAM_DEC_ID" : "MC17",
      "CONF_PARAM_LABEL" : "Threshold surface/Intermediate Pressure",
      "CONF_PARAM_DEFINITION" : "Threshold surface/Intermediate Pressure (dbar) The isobar that divides surface depths from intermediate depths for the purpose of data reduction. ARVOR-I can transmit up to 2015 samples per cycle. Theoretical number of samples to be acquired can be estimated based on different threshold between 3 zones and on slices thickness.",
      "CONF_PARAM_NAME" : "CONFIG_PressureThresholdDataReductionShallowToIntermediate_dbar",
      "CONF_PARAM_DESCRIPTION" : "The isobar that divides shallow depths from intermediate depths for the purpose of data reduction with 3 depth zones (in dbars)."
   },
   "CONF_PARAM_13" :
   {
      "CONF_PARAM_DEC_ID" : "MC18",
      "CONF_PARAM_LABEL" : "Threshold Intermediate /bottom Pressure",
      "CONF_PARAM_DEFINITION" : "Threshold Intermediate / Bottom Pressure (dbar) The isobar that divides Intermediate depths from shallow depths for the purpose of data reduction. ARVOR-I can transmit up to 2015 samples per cycle. Theoretical number of samples to be acquired can be estimated based on different threshold between 3 zones and on slices thickness.",
      "CONF_PARAM_NAME" : "CONFIG_PressureThresholdDataReductionIntermediateToDeep_dbar",
      "CONF_PARAM_DESCRIPTION" : "The isobar that divides intermediate depths from deep depths for the purpose of data reduction with 3 depth zones (in dbars)."
   },
   "CONF_PARAM_14" :
   {
      "CONF_PARAM_DEC_ID" : "MC19",
      "CONF_PARAM_LABEL" : "Thickness of the surface slices",
      "CONF_PARAM_DEFINITION" : "Thickness of the surface slices (dbar) Thickness of the slices for shallow depths (algorithm of data reduction). ARVOR-I can transmit up to 2015 samples per cycle. Theoretical number of samples to be acquired can be estimated based on different threshold between 3 zones and on slices thickness.",
      "CONF_PARAM_NAME" : "CONFIG_ProfileSurfaceSlicesThickness_dbar",
      "CONF_PARAM_DESCRIPTION" : "Thickness of the slices for shallow depths (algorithm of data reduction) (in dbars)."
   },
   "CONF_PARAM_15" :
   {
      "CONF_PARAM_DEC_ID" : "MC20",
      "CONF_PARAM_LABEL" : "Thickness of the intermediate slices",
      "CONF_PARAM_DEFINITION" : "Thickness of the intermediate slices (dbar) Thickness of the slices for intermediate depths (algorithm of data reduction). ARVOR-I can transmit up to 2015 samples per cycle. Theoretical number of samples to be acquired can be estimated based on different threshold between 3 zones and on slices thickness.",
      "CONF_PARAM_NAME" : "CONFIG_ProfileIntermediateSlicesThickness_dbar",
      "CONF_PARAM_DESCRIPTION" : "Thickness of the slices for intermediate depths (algorithm of data reduction) (in dbars)."
   },
   "CONF_PARAM_16" :
   {
      "CONF_PARAM_DEC_ID" : "MC21",
      "CONF_PARAM_LABEL" : "Thickness of the bottom slices",
      "CONF_PARAM_DEFINITION" : "Thickness of the bottom slices (dbar) Thickness of the slices for deep depths (algorithm of data reduction). ARVOR-I can transmit up to 2015 samples per cycle. Theoretical number of samples to be acquired can be estimated based on different threshold between 3 zones and on slices thickness.",
      "CONF_PARAM_NAME" : "CONFIG_ProfileBottomSlicesThickness_dbar",
      "CONF_PARAM_DESCRIPTION" : "Thickness of the slices for deep depths (algorithm of data reduction) (in dbars)."
   },
   "CONF_PARAM_17" :
   {
      "CONF_PARAM_DEC_ID" : "MC22",
      "CONF_PARAM_LABEL" : "Iridium End Of life period",
      "CONF_PARAM_DEFINITION" : "Iridium End of life transmission period (minutes) Transmission period (in hours) once float is in “end of life mode” (all programmed cycles have been reached. Float send Technical SBD message.",
      "CONF_PARAM_NAME" : "CONFIG_TransmissionPeriodEndOfLife_minutes",
      "CONF_PARAM_DESCRIPTION" : "Period of the Iridium transmission when in End Of Life mode (in minutes)."
   },
   "CONF_PARAM_18" :
   {
      "CONF_PARAM_DEC_ID" : "MC23",
      "CONF_PARAM_LABEL" : "2nd Iridium Session Wait Period",
      "CONF_PARAM_DEFINITION" : "2nd Iridium Session Wait Period (min) At beginning of cycle, if this parameter is different of zero, 2 SBD sessions will occur. This enable to check if a change on mission or technical parameter has been correctly treated by float and if new parameters are effective for next cycle. After the 1st transmission, float will wait for MC23 minutes before proceeding to 2nd transmission.",
      "CONF_PARAM_NAME" : "CONFIG_TelemetryRepeatSessionDelay_minutes",
      "CONF_PARAM_DESCRIPTION" : "Delay before a second Iridium session performed by the float just before diving for a new cycle (in minutes)."
   },
   "CONF_PARAM_19" :
   {
      "CONF_PARAM_DEC_ID" : "MC24",
      "CONF_PARAM_LABEL" : "Grounding mode (0= Shift, 1 : Stay grounded)",
      "CONF_PARAM_DEFINITION" : "Grounding mode MC24 = 0 means shift, MC24 = 1, means float stay grounded.",
      "CONF_PARAM_NAME" : "CONFIG_GroundingMode_LOGICAL",
      "CONF_PARAM_DESCRIPTION" : "Action performed by the float when a grounding is detected. 0: the float changes its drift pressure, 1: the float stays on the seabed until the next phase of the cycle."
   },
   "CONF_PARAM_20" :
   {
      "CONF_PARAM_DEC_ID" : "MC25",
      "CONF_PARAM_LABEL" : "Grouding switch pressure",
      "CONF_PARAM_DEFINITION" : "Grounding switch pressure In case of grounding during descent to parking depth, float will reduce target pressure from MC25 dBars.",
      "CONF_PARAM_NAME" : "CONFIG_GroundingModePresAdjustment_dbar",
      "CONF_PARAM_DESCRIPTION" : "If in grounding mode 0, the float changes its drift pressure to its programmed one minus this value only if its current pressure is greater than this value."
   },
   "CONF_PARAM_21" :
   {
      "CONF_PARAM_DEC_ID" : "MC26",
      "CONF_PARAM_LABEL" : "Delay at surface if grounding at surface",
      "CONF_PARAM_DEFINITION" : "Delay in case of grounding at surface (minutes)",
      "CONF_PARAM_NAME" : "CONFIG_TimeDelaybeforeDescentRetryWhenStuckAtSurface_minutes",
      "CONF_PARAM_DESCRIPTION" : "Time delay between each new attempt to descend when the float is stuck at the surface. When the float cannot reach the pressure threshold defined by CONFIG_BuoyancyReductionFirstThreshold_dbar after a given number of buoyancy actions it waits a period of time specified by CONFIG_TimeDelaybeforeDescentRetryWhenStuckAtSurface_minutes before starting a new sequence of buoyancy actions."
   },
   "CONF_PARAM_22" :
   {
      "CONF_PARAM_DEC_ID" : "MC27",
      "CONF_PARAM_LABEL" : "Optode type (0: none, 1 : 4330, 2 : 3830)",
      "CONF_PARAM_DEFINITION" : "Switch the optode off/on",
      "CONF_PARAM_NAME" : "CONFIG_OptodePowerAcquisitionMode_NUMBER",
      "CONF_PARAM_DESCRIPTION" : "Power acquisition mode of the Sensor defined by <short sensor name> in the depth zone #<N>. Specifying depth zone is optional e.g. if the power acquistion mode is common to all depth zones then there is no need to specify depth zone. Input options for CTD (1 : continuous, 2 : pulsed). Input options for Optode (0: none, 1 : continuous, 2 : pulsed)."
   },
   "CONF_PARAM_23" :
   {
      "CONF_PARAM_DEC_ID" : "MC29",
      "CONF_PARAM_LABEL" : "“In Air acquisition” cycle periodicity",
      "CONF_PARAM_DEFINITION" : "“In Air acquisition” cycle periodicity Cycle periodicity for “In Air acquisition to be executed. 0 means no “In Air acquisition 1 means “In Air acquisition” every cycle X means “In Air acquisition” one cycle every “x” cycles",
      "CONF_PARAM_NAME" : "CONFIG_InAirMeasurementPeriodicity_NUMBER",
      "CONF_PARAM_DESCRIPTION" : "Cycle periodicity of the in air measurement phase: - 0 means no in air acquisition - 1 means in air acquisition every cycle - N means in air acquisition one cycle every N cycles"
   },
   "CONF_PARAM_24" :
   {
      "CONF_PARAM_DEC_ID" : "MC30",
      "CONF_PARAM_LABEL" : "“In Air acquisition” sampling period",
      "CONF_PARAM_DEFINITION" : "“In Air acquisition” sampling period (seconds) Delay between each CTD sample acquired during “In Air acquisition” phase",
      "CONF_PARAM_NAME" : "CONFIG_InAirMeasurementSamplingPeriod_seconds",
      "CONF_PARAM_DESCRIPTION" : "Sampling period during the in air measurement phase."
   },
   "CONF_PARAM_25" :
   {
      "CONF_PARAM_DEC_ID" : "MC31",
      "CONF_PARAM_LABEL" : "“In Air acquisition” total duration",
      "CONF_PARAM_DEFINITION" : "“In Air acquisition” total duration (minutes) Total duration for “In Air” acquisition",
      "CONF_PARAM_NAME" : "CONFIG_InAirMeasurementTime_minutes",
      "CONF_PARAM_DESCRIPTION" : "Duration of the in air measurement phase."
   },
   "CONF_PARAM_26" :
   {
      "CONF_PARAM_DEC_ID" : "TC00",
      "CONF_PARAM_LABEL" : "Durée maxi d'activation ev en surface (utilisée pour P < palier1)",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_SurfaceValveMaxTimeAdditionalActions_csec",
      "CONF_PARAM_DESCRIPTION" : "Maximum duration of the additional valve actions performed at the surface during the buoyancy reduction phase (in centi-seconds)."
   },
   "CONF_PARAM_27" :
   {
      "CONF_PARAM_DEC_ID" : "TC01",
      "CONF_PARAM_LABEL" : "Volume transféré par l'ev maxi autorisé en profondeur",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_OilVolumeMaxPerValveAction_cm^3",
      "CONF_PARAM_DESCRIPTION" : "This information is used as a threshold for the valve action durations. The valve flow is known for each float and CONFIG_OilVolumeMaxPerValveAction_cm^3 is converted to a maxDurationOfValveAction.  During descent phases the float regularly computes a valve duration to sink to the target depth. In some specific cases the result can be a huge valve action duration and the result must be thresholded by maxDurationOfValveAction. So yes, this information is a configuration parameter (and for Remocean float it can be modified via remote controls, but of course by specialist in PROVOR vector configuration)."
   },
   "CONF_PARAM_28" :
   {
      "CONF_PARAM_DEC_ID" : "TC02",
      "CONF_PARAM_LABEL" : "Durée maxi d'activation pompe en profondeur",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_PumpActionMaxTimeReposition_csec",
      "CONF_PARAM_DESCRIPTION" : "Maximum duration of the pump action for a drift readjustment (in centi-seconds)."
   },
   "CONF_PARAM_29" :
   {
      "CONF_PARAM_DEC_ID" : "TC03",
      "CONF_PARAM_LABEL" : "Durée maxi d'activation pompe en remontée",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_PumpActionMaxTimeAscent_csec",
      "CONF_PARAM_DESCRIPTION" : "Maximum duration of a pump action during ascent (in centi-seconds)."
   },
   "CONF_PARAM_30" :
   {
      "CONF_PARAM_DEC_ID" : "TC04",
      "CONF_PARAM_LABEL" : "Durée nominale d'activation pompe en émergence",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_PumpActionTimeBuoyancyAcquisition_csec",
      "CONF_PARAM_DESCRIPTION" : "Duration of the last pump action of the buoyancy acquisition phase (in centi-seconds)."
   },
   "CONF_PARAM_31" :
   {
      "CONF_PARAM_DEC_ID" : "TC05",
      "CONF_PARAM_LABEL" : "Tolérance sur l'atteinte de la pression de consigne (+/-)",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_PressureTargetToleranceForStabilisation_dbar",
      "CONF_PARAM_DESCRIPTION" : "Defines the target pressure interval for float stabilisation at parking or profile depth (in dbars)."
   },
   "CONF_PARAM_32" :
   {
      "CONF_PARAM_DEC_ID" : "TC06",
      "CONF_PARAM_LABEL" : "Pression maxi à ne pas dépasser",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_PressureMaxBeforeEmergencyAscent_dbar",
      "CONF_PARAM_DESCRIPTION" : "Emergency ascent phase start pressure (in dbars)."
   },
   "CONF_PARAM_33" :
   {
      "CONF_PARAM_DEC_ID" : "TC07",
      "CONF_PARAM_LABEL" : "Pression de début de réduction de la durée d'activation ev en surface",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_BuoyancyReductionFirstThreshold_dbar",
      "CONF_PARAM_DESCRIPTION" : "First threshold of the buoyancy reduction phase (in dbars). From the surface to this first threshold, the float performs one initial valve action (of a computed duration) and N1 additional valve actions (of fixed durations) until the crossing of this first threshold."
   },
   "CONF_PARAM_34" :
   {
      "CONF_PARAM_DEC_ID" : "TC08",
      "CONF_PARAM_LABEL" : "Critère de pression de début de plongée",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_BuoyancyReductionSecondThreshold_dbar",
      "CONF_PARAM_DESCRIPTION" : "Second threshold of the buoyancy reduction phase (in dbars). From the first threshold to this second threshold, the float performs N2 additional valve actions (of computed durations) until the crossing of this second threshold. The descent to park phase starts at the crossing of this second threshold."
   },
   "CONF_PARAM_35" :
   {
      "CONF_PARAM_DEC_ID" : "TC09",
      "CONF_PARAM_LABEL" : "Nbre de positions hors tolérance autorisé en dérive conduisant à repositionnement",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_NumberOfOutOfTolerancePresBeforeReposition_COUNT",
      "CONF_PARAM_DESCRIPTION" : "Number of consecutive pressure measurements outside the target pressure interval before performing a drift readjustment."
   },
   "CONF_PARAM_36" :
   {
      "CONF_PARAM_DEC_ID" : "TC10",
      "CONF_PARAM_LABEL" : "Critère d'échouage: volume cumulé",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_OilVolumeMinForGroundingDetection_cm^3",
      "CONF_PARAM_DESCRIPTION" : "This information is a threshold used to detect a grounding of the float. If there is no vertical motion after having tranfered CONFIG_OilVolumeMinForGroundingDetection_cm^3 through the valve, the gounded flag is activated and the float acts as configurated by the CONFIG_GroundingMode_LOGICAL parameter.So, yes it is a configuration parameter (and I can easily understand that it can be modified via remote control since some PROVOR floats have experienced erroneous grounding detection (under study but perhaps due to in-situ conditions)."
   },
   "CONF_PARAM_37" :
   {
      "CONF_PARAM_DEC_ID" : "TC11",
      "CONF_PARAM_LABEL" : "Pression en dessous de laquelle le flotteur reste posé en attente profil remontée",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_GroundingModeMinPresThreshold_dbar",
      "CONF_PARAM_DESCRIPTION" : "If in grounding mode 0, the float changes its drift pressure only if its current pressure is greater than this value."
   },
   "CONF_PARAM_38" :
   {
      "CONF_PARAM_DEC_ID" : "TC12",
      "CONF_PARAM_LABEL" : "Tolérance sur maintien de la pression de consigne (+/-)",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_PressureTargetToleranceDuringDrift_dbar",
      "CONF_PARAM_DESCRIPTION" : "Defines the target pressure interval for float drift at parking or profile depth (in dbars)."
   },
   "CONF_PARAM_39" :
   {
      "CONF_PARAM_DEC_ID" : "TC13",
      "CONF_PARAM_LABEL" : "Vitesse moyenne descente",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_DescentSpeed_mm/s",
      "CONF_PARAM_DESCRIPTION" : "Descent speed during downcast in mm/s (can be used to estimate the time to descent from parking pressure to profile pressure)"
   },
   "CONF_PARAM_40" :
   {
      "CONF_PARAM_DEC_ID" : "TC15",
      "CONF_PARAM_LABEL" : "Pression de fin de remontée.",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_AscentEndThreshold_dbar",
      "CONF_PARAM_DESCRIPTION" : "Threshold used by the float to stop ascent speed control and pump actions."
   },
   "CONF_PARAM_41" :
   {
      "CONF_PARAM_DEC_ID" : "TC16",
      "CONF_PARAM_LABEL" : "Vitesse moyenne de remontée.",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_AscentSpeed_mm/s",
      "CONF_PARAM_DESCRIPTION" : "ascent speed during upcast in mm/s or cm/s (can be used to estimate the profile duration)"
   },
   "CONF_PARAM_42" :
   {
      "CONF_PARAM_DEC_ID" : "TC17",
      "CONF_PARAM_LABEL" : "Période de mesure de la pression en remontée (période du contrôle de la vitesse de remontée).",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_PressureCheckTimeAscent_minutes",
      "CONF_PARAM_DESCRIPTION" : "Period of the pressure checks during the float ascent to surface (in minutes)."
   },
   "CONF_PARAM_43" :
   {
      "CONF_PARAM_DEC_ID" : "TC18",
      "CONF_PARAM_LABEL" : "Ecart de pression pour stabilisation en remontée (tous les TC17, si |DP|  < TC18 => action de pompe).",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_AscentVerticalThresholdForBuoyancyAction_dbar",
      "CONF_PARAM_DESCRIPTION" : "If the float vertical motion, during CONFIG_PressureCheckTimeAscent_minutes, is less than this threshold, the float makes buoyancy adjustments."
   },
   "CONF_PARAM_44" :
   {
      "CONF_PARAM_DEC_ID" : "TC19",
      "CONF_PARAM_LABEL" : "GPS session duration",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_GPSTimeout_minutes",
      "CONF_PARAM_DESCRIPTION" : "Timeout for GPS acquisition."
   },
   "CONF_PARAM_45" :
   {
      "CONF_PARAM_DEC_ID" : "TC20",
      "CONF_PARAM_LABEL" : "Transmission message hydraulique (0 non, 1 oui).",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_HydraulicDataTransmission_LOGICAL",
      "CONF_PARAM_DESCRIPTION" : "The float transmits hydraulic data at the end of the cycle. The float records the pump/valve actions (time, pressure, duration), these data can be transmitted (or not) in specific SBD messages through a remote control command.  Input: (Yes=1/No=0)."
   },
   "CONF_PARAM_46" :
   {
      "CONF_PARAM_DEC_ID" : "TC21",
      "CONF_PARAM_LABEL" : "Delay before resetoffset",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_PressureOffsetDelayBeforeResetCommand_minutes",
      "CONF_PARAM_DESCRIPTION" : "Float waiting period before the Surface ResetOffset CTD command. NKE introduced a delay (in minutes) between the end of the transmission and the ResetOffset command (because surface pressure measurements seem to be corrupted by float transmission)."
   },
   "CONF_PARAM_47" :
   {
      "CONF_PARAM_DEC_ID" : "TC22",
      "CONF_PARAM_LABEL" : "Duration Pump during for surfacing with “In Air Acqu”",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_PumpActionTimeBuoyancyAcquisitionForInAirMeasCycle_csec",
      "CONF_PARAM_DESCRIPTION" : "Duration of the last pump action of the buoyancy acquisition phase when a in air measurement phase is programmed (in centi-seconds). [For a cycle without in air measurement phase it is CONFIG_PumpActionTimeBuoyancyAcquisition_csec]."
   },
   "CONF_PARAM_48" :
   {
      "CONF_PARAM_DEC_ID" : "TC23",
      "CONF_PARAM_LABEL" : "Iridium timeout",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_ConnectionTimeOut_minutes",
      "CONF_PARAM_DESCRIPTION" : "Connection time-out, i.e. maximum transmission period for one telemetry session"
   },
   "CONF_PARAM_49" :
   {
      "CONF_PARAM_DEC_ID" : "TC24",
      "CONF_PARAM_LABEL" : "Coefficient de calibrage pression Coeff A (coefficient de calibration utilisé pour convertir la pression interne).",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_InternalPressureCalibrationCoef1_NUMBER",
      "CONF_PARAM_DESCRIPTION" : "First coefficient used to compute float internal pressure in mBars from sensor counts."
   },
   "CONF_PARAM_50" :
   {
      "CONF_PARAM_DEC_ID" : "TC25",
      "CONF_PARAM_LABEL" : "Coefficient de calibrage pression Coeff B (coefficient de calibration utilisé pour convertir la pression interne).",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_InternalPressureCalibrationCoef2_NUMBER",
      "CONF_PARAM_DESCRIPTION" : "Second coefficient used to compute float internal pressure in mBars from sensor counts."
   },
   "CONF_PARAM_51" :
   {
      "CONF_PARAM_DEC_ID" : "IC00",
      "CONF_PARAM_LABEL" : "Nb of day without surface emergence if Ice detected",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionSpringInhibitionDelaySinceLastIceEvasion_days",
      "CONF_PARAM_DESCRIPTION" : "Maximum delay (in days/cycles) since the last ice evasiondate to attempt a surfacing.  This is often called the 'Spring', where the float stays underwater for a time even though the temperature has warmed."
   },
   "CONF_PARAM_52" :
   {
      "CONF_PARAM_DEC_ID" : "IC01",
      "CONF_PARAM_LABEL" : "Nb of day before surface emergence even with ice detected",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionMaxDaysNoTransmission_NUMBER",
      "CONF_PARAM_DESCRIPTION" : "Maximum delay (in days/cycles) of no transmission due to the ice detection algorithm. This parameter is used to disable the ice detection algorithmand force the float to surface even if ice is detected."
   },
   "CONF_PARAM_53" :
   {
      "CONF_PARAM_DEC_ID" : "IC02",
      "CONF_PARAM_LABEL" : "Nb of detection to confirm Ice at surface",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionConsecutiveDetectionBeforeFloatSurfaceInhibition_NUMBER",
      "CONF_PARAM_DESCRIPTION" : "Number of consecutive ISA detections before float surface inhibition.If fewer consecutive ice detections are made, then the float will immediately seek the surface if mixed layer temp is warm."
   },
   "CONF_PARAM_54" :
   {
      "CONF_PARAM_DEC_ID" : "IC03",
      "CONF_PARAM_LABEL" : "Start pressure detection",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionMixedLayerPMax_dbar",
      "CONF_PARAM_DESCRIPTION" : "Maximum sampling pressure used by ice cover detection algorithm. i.e. start pressure threshold for the ice detection algorithm."
   },
   "CONF_PARAM_55" :
   {
      "CONF_PARAM_DEC_ID" : "IC04",
      "CONF_PARAM_LABEL" : "Stop pressure detection",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionMixedLayerPMin_dbar",
      "CONF_PARAM_DESCRIPTION" : "Minimum sampling pressure used by ice cover detection algorithm."
   },
   "CONF_PARAM_56" :
   {
      "CONF_PARAM_DEC_ID" : "IC05",
      "CONF_PARAM_LABEL" : "Temperature threshold",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetection_degC",
      "CONF_PARAM_DESCRIPTION" : "Ice temperature in [degree Celsius/1e3] where profiles are aborted because of ice formation conditions"
   },
   "CONF_PARAM_57" :
   {
      "CONF_PARAM_DEC_ID" : "IC06",
      "CONF_PARAM_LABEL" : "Slowdown pressure threshold",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_AscentSpeedStartPressureThresholdForSlowPhase_dbar",
      "CONF_PARAM_DESCRIPTION" : "Pressure threshold to start the slow ascent speed phase."
   },
   "CONF_PARAM_58" :
   {
      "CONF_PARAM_DEC_ID" : "IC07",
      "CONF_PARAM_LABEL" : "Pressure acquisition period during ascent (slow speed), once P < IC6",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionPressureInterval_dbar",
      "CONF_PARAM_DESCRIPTION" : "Period of the ice detection algorithm."
   },
   "CONF_PARAM_59" :
   {
      "CONF_PARAM_DEC_ID" : "IC08",
      "CONF_PARAM_LABEL" : "Pressure delta min before pump action",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionAscentVerticalThresholdForBuoyancyAction_dbar",
      "CONF_PARAM_DESCRIPTION" : "Similar to CONFIG_AscentVerticalThresholdForBuoyancyAction_dbar but for a float in ice detection mode."
   },
   "CONF_PARAM_60" :
   {
      "CONF_PARAM_DEC_ID" : "IC09",
      "CONF_PARAM_LABEL" : "Pump action duration",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionPumpActionMaxTimeAscent_csec",
      "CONF_PARAM_DESCRIPTION" : "Similar to CONFIG_PumpActionMaxTimeAscent_csec but for a float in ice detection mode."
   },
   "CONF_PARAM_61" :
   {
      "CONF_PARAM_DEC_ID" : "IC10",
      "CONF_PARAM_LABEL" : "GPS timeout",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_GPSTimeout_minutes",
      "CONF_PARAM_DESCRIPTION" : "Timeout for GPS acquisition."
   },
   "CONF_PARAM_62" :
   {
      "CONF_PARAM_DEC_ID" : "IC11",
      "CONF_PARAM_LABEL" : "1st Iridium lock timetout",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionConnectionTimeOut_minutes",
      "CONF_PARAM_DESCRIPTION" : "Similar to CONFIG_ConnectionTimeOut_minutes but for the first telemetry session of a float in ice detection mode(i.e. in ice detection mode the float reduces the timeout of the first Iridium connection: if the first connection fails the cycle is aborted (ice probably present) but if the first connection succeeds (waters free of ice) the float switches to the nominal timeout (CONFIG_ConnectionTimeOut_minutes) for the following transmissions of the current cycle)."
   },
   "CONF_PARAM_63" :
   {
      "CONF_PARAM_DEC_ID" : "IC12",
      "CONF_PARAM_LABEL" : "Delay before ascent blocking detection",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionNoVerticalMotionTimeOut_csec",
      "CONF_PARAM_DESCRIPTION" : "When the float is in ice detection mode if, despite of pump actions, no vertical motion is detected during this delay, the cycle is aborted."
   },
   "CONF_PARAM_64" :
   {
      "CONF_PARAM_DEC_ID" : "IC13",
      "CONF_PARAM_LABEL" : "Pressure variation for speed inversion",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionDescentVerticalThresholdToEndBuoyancyInversionPhase_dbar",
      "CONF_PARAM_DESCRIPTION" : "When the cycle is aborted this threshold is used to detect speed inversion and to stop buoyancy inversion phase."
   },
   "CONF_PARAM_65" :
   {
      "CONF_PARAM_DEC_ID" : "IC14",
      "CONF_PARAM_LABEL" : "Valve action volume",
      "CONF_PARAM_DEFINITION" : "",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionOilVolumePerValveAction_cm^3",
      "CONF_PARAM_DESCRIPTION" : "Valve action duration during the buoyancy inversion phase."
   },
   "CONF_PARAM_66" :
   {
      "CONF_PARAM_DEC_ID" : "IC15",
      "CONF_PARAM_LABEL" : "Max valve volume to detect grounding on descent",
      "CONF_PARAM_DEFINITION" : "TBD",
      "CONF_PARAM_NAME" : "CONFIG_IceDetectionOilVolumeMinForGroundingDetection_cm^3",
      "CONF_PARAM_DESCRIPTION" : "Similar to CONFIG_OilVolumeMinForGroundingDetection_cm^3 but for a float in a buoyancy inversion phase."
   },
   "CONF_PARAM_67" :
   {
      "CONF_PARAM_DEC_ID" : "PX00",
      "CONF_PARAM_LABEL" : "Profiling direction",
      "CONF_PARAM_DEFINITION" : "The float can perform descending profiles or ascending profiles or both.",
      "CONF_PARAM_NAME" : "CONFIG_Direction_NUMBER",
      "CONF_PARAM_DESCRIPTION" : "Ascending = 1, Descending = 2, Ascending and Descending = 3"
   },
   "CONF_PARAM_68" :
   {
      "CONF_PARAM_DEC_ID" : "PX01",
      "CONF_PARAM_LABEL" : "Cut-off pressure of the CTD pump",
      "CONF_PARAM_DEFINITION" : "During the ascending profile, the CTD pump is switched off at a prescribed depth.",
      "CONF_PARAM_NAME" : "CONFIG_CTDPumpStopPressure_dbar",
      "CONF_PARAM_DESCRIPTION" : "The pressure at which the CTD pump is switched off.  As the float ascends, the code looks at the pressure and if <= CONFIG_CTDPumpStopPressure, the CTD is turned off. CTDPumpStopPressure is a firmware threshold and as such, data may continue to be collected for a limited span after the threshold is recognized. Especially in floats that return high resolution discrete data, there might be data collected shallower than the cut off, due to the discrete nature of the pressure data and also due to the time necessary for the firmware to turn off the CTD once the pressure threshold is reached. For example for SOLOII floats the CTD is switched off at 1dbar, and typically the shallowest data is from 0.5 to 0.8 dbar. This shallow data should be carefully assessed for its validity."
   },
   "CONF_PARAM_69" :
   {
      "CONF_PARAM_DEC_ID" : "PX02",
      "CONF_PARAM_LABEL" : "Cut-off pressure of the ascent profile",
      "CONF_PARAM_DEFINITION" : "Pressure to use to separate pumped/unpumped data in the ascent profile",
      "CONF_PARAM_NAME" : "CONFIG_CTDPumpStopPressurePlusThreshold_dbar",
      "CONF_PARAM_DESCRIPTION" : "The sum of CONFIG_CTDPumpStopPressure_dbar plus a pressure threshold or overlap (Poverlap). For PROVOR floats, Poverlap is defined as follows:  Poverlap = bin_size/2 for PROVOR floats with software versions < 5816A00 and ARVOR floats with software versions < 5605A00. Poverlap = 0.5 dbar for PROVOR floats with software versions >= 5816A00 and ARVOR floats with software versions >=5605A00."
   },
   "CONF_PARAM_70" :
   {
      "CONF_PARAM_DEC_ID" : "PX03",
      "CONF_PARAM_LABEL" : "Pressure offset between CTD and Optode sensors",
      "CONF_PARAM_DEFINITION" : "Pressure offset between CTD and Optode sensors",
      "CONF_PARAM_NAME" : "CONFIG_OptodeVerticalPressureOffset_dbar",
      "CONF_PARAM_DESCRIPTION" : "vertical pressure offset due to the fact that the sensor is not exactly at the Ctd pressure"
   },
   "CONF_PARAM_71" :
   {
      "CONF_PARAM_DEC_ID" : "PX04",
      "CONF_PARAM_LABEL" : "Optode is mounted on an additional stick",
      "CONF_PARAM_DEFINITION" : "Optode is mounted on an additional stick",
      "CONF_PARAM_NAME" : "CONFIG_OptodeMeasurementsInAir_LOGICAL",
      "CONF_PARAM_DESCRIPTION" : "Sensors can be mounted on a stick to perform measurements in Air. Values: Yes = 1, No = 0"
   },
   "CONF_PARAM_72" :
   {
      "CONF_PARAM_DEC_ID" : "PX05",
      "CONF_PARAM_LABEL" : "Ice detection activity flag",
      "CONF_PARAM_DEFINITION" : "Mandatory configuration parameter for Ice floats.",
      "CONF_PARAM_NAME" : "CONFIG_BitMaskMonthsIceDetectionActive_NUMBER",
      "CONF_PARAM_DESCRIPTION" : "This parameter indicates for which months the ice detection algorithm is active. The bit mask is input as a 3 digit hexadecimal value in the mission file sent to the float. This parameter in the metadata file however is the decimal number of that hexadecimal value. For example for the Southern Hemisphere the default position is to have the ice detection algorithm active for all months except February. (The hexadecimal value in the mission file is 'FFD' and the number for the configuration parameter in the metafile would be 4093). The northern hemisphere default would be all months active except for August. In this case the hexadecimal value is 'F7F' and the number in the configuration parameter in the metafile would be 3967). "
   }
}
